tutorials/pressureDriven/successor/0.orig/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Cu1                  0.528;
Cu2                  0.385;
Cu3                  -1.09;
Cu4                  0.243;

Ck1		     0.921;
Ck2		     3.533;
Ck3		     -1.926;
Ck4		     0.805;

hd                   500;
kappa                0.40;
Cmu                  0.09;
flowDir              (1 0 0);
zDir                 (0 0 1);
uTau                 0.622;
z0                   uniform 0.01;

// Initial values
omegaInit            0.005;
nutInit              0;
kInit	             0.5;
epsilonInit          0.1;

// Values at top boundary
topVelocity          uniform (27.3 0 0);


// ************************************************************************* //
