tutorials/pressureDriven/successor/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.01;
    }

    "(U|k|epsilon|omega)"
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent               true;
    //pRefCell                 0;
    //pRefValue                0;

    //residualControl
    //{
    //    p               1e-5;
    //    U               1e-7;
    //    "(k|omega|epsilon)"   1e-7;
    //}

}

relaxationFactors
{
    equations
    {
        U                    0.4;
        "(k|epsilon|omega)"  0.4;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
